import css from "../Begin/Begin.module.css";

export default function Begin() {

    return (
        <div className={css.beginBox}>
          <h4>Що ж таке кх?</h4>
          <p>Кх - це збірка на кількість ходів.<br/> За правилами у вас є година і до 3 кубів щоб знайти та записати якнайбільш оптимальне рішення певного стану кубика рубика. <br/>Збирати можна будь-яким методом, поки ваше рішення влазить в 80 рухів, тому почати збирати можна навіть не вивчаючи нічого нового…</p>
          <h4>CFOP</h4>
          <p>Зазвичай люди які починають цікавитись збіркою на кількість рухів вже знають CFOP, або фрідріх, хоча б частково, тому почну звідси.<br/>
            CFOP є абсолютно нормальним методом для збірки на кількість рухів, і донедавна український національний рекорд був встановлений саме звичайним фрідріхом, з додаванням однієї техніки до якої ми дійдемо пізніше.
            </p>
          <p>Ресурсів в даній секції я не буду давати, але є декілька рекомендацій.<br/>
            По-перше, пробуйте, пробуйте багато.<br/> У вас є аж ціла година, використайте її з користю. <br/>Пробуйте збирати з різних кольорів, в різному порядку пар і заганяючи їх по-різному, поки не знайдете щось везуче, і навіть тоді не зупиняйтесь шукати.<br/>
            По-друге, навчіться записувати рішення без перехватів.<br/> На початку це може здаватись не звичним, але запам’ятати яка грань якій літері відповідає достатньо просто, і дуже зручно, а через декілька секцій стане необхідно. <br/>Не роблячи перехватів у вас не буде проблем що ви випадково перехватили коли записували і не знаєте як продовжувати, не побачили що хід скорочується чи взагалі написали не той перехват і отримали днф.
            </p>
        </div>
    );
}
